3D_Inviscid/system/aerofoilPressure
aerofoilSurfacePressure
{
    type            surfaces;
    libs            ("libsampling.so");

    writeControl    writeTime;
    surfaceFormat   raw;
    interpolationScheme cellPoint;

    fields          (p);

    surfaces
    (
        aerofoilSurface
        {
            type        patch;
            patches     (wing);
            interpolate true;
        }
    );
}
